Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ECAT.h
#define ECAT_AL_EVENT_REQUEST_BF15_MASK          (0x8000U)
#define ECAT_AL_EVENT_REQUEST_BF15_SHIFT         (15U)
/*! BF15 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager 7 interrupt
 *  0b1..SyncManager 7 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF15(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF15_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF15_MASK)

#define ECAT_AL_EVENT_REQUEST_BF16_MASK          (0xFFFF0000U)
#define ECAT_AL_EVENT_REQUEST_BF16_SHIFT         (16U)
/*! BF16 - Reserved */
#define ECAT_AL_EVENT_REQUEST_BF16(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF16_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF16_MASK)
/*! @} */

/*! @name RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT - RX Error Counter */
/*! @{ */

#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF0_MASK (0xFFU)
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF0_SHIFT (0U)
/*! BF0 - Invalid frame counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF0_SHIFT)) & ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF0_MASK)

#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF8_MASK (0xFF00U)
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF8_SHIFT (8U)
/*! BF8 - RX Error counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF8(x) (((uint16_t)(((uint16_t)(x)) << ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF8_SHIFT)) & ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_BF8_MASK)
/*! @} */

/* The count of ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT */
#define ECAT_RX_ERROR_COUNT_E                    (2U)

/*! @name RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI - RX Error Counter */
/*! @{ */

#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF0_MASK (0xFFU)
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF0_SHIFT (0U)
/*! BF0 - Invalid frame counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF0_SHIFT)) & ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF0_MASK)

#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF8_MASK (0xFF00U)
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF8_SHIFT (8U)
/*! BF8 - RX Error counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF8(x) (((uint16_t)(((uint16_t)(x)) << ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF8_SHIFT)) & ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI_BF8_MASK)
/*! @} */

/* The count of ECAT_RX_ERROR_CNTR_RX_ERROR_COUNTER_PORT_PDI */
#define ECAT_RX_ERROR_COUNT_P                    (2U)

/*! @name FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT - Forwarded RX Error Counter */
/*! @{ */

#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_BF0_MASK (0xFFU)
#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_BF0_SHIFT (0U)
/*! BF0 - Forwarded error counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_BF0_SHIFT)) & ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_BF0_MASK)
/*! @} */

/* The count of ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT */
#define ECAT_FORWARDED_RX_ERROR_COUNT_E          (2U)

/*! @name FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI - Forwarded RX Error Counter */
/*! @{ */

#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI_BF0_MASK (0xFFU)
#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI_BF0_SHIFT (0U)
/*! BF0 - Forwarded error counter of Port y (counting is stopped when 0xFF is reached). */
#define ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI_BF0_SHIFT)) & ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FORWARDED_RX_ERROR_CNTR_FORWARDED_RX_ERROR_COUNTER_PORT_PDI */
#define ECAT_FORWARDED_RX_ERROR_COUNT_P          (2U)

/*! @name ECAT_PROCESSING_UNIT_ERROR_COUNTER - ECAT Processing Unit Error Counter */
/*! @{ */

#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_BF0_MASK (0xFFU)
#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_BF0_SHIFT (0U)
/*! BF0 - ECAT Processing Unit error counter (counting is stopped when 0xFF is reached). Counts
 *    errors of frames passing the Processing Unit.
 */
#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_BF0_SHIFT)) & ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_BF0_MASK)
/*! @} */

/*! @name ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI - ECAT Processing Unit Error Counter */
/*! @{ */

#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI_BF0_MASK (0xFFU)
#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI_BF0_SHIFT (0U)
/*! BF0 - ECAT Processing Unit error counter (counting is stopped when 0xFF is reached). Counts
 *    errors of frames passing the Processing Unit.
 */
#define ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI_BF0_SHIFT)) & ECAT_ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI_BF0_MASK)
/*! @} */

/*! @name PDI_ERROR_COUNTER - PDI Error counter */
/*! @{ */

#define ECAT_PDI_ERROR_COUNTER_BF0_MASK          (0xFFU)
#define ECAT_PDI_ERROR_COUNTER_BF0_SHIFT         (0U)
/*! BF0 - PDI Error counter (counting is stopped when 0xFF is reached). Counts if a PDI access has an interface error. */
#define ECAT_PDI_ERROR_COUNTER_BF0(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_PDI_ERROR_COUNTER_BF0_SHIFT)) & ECAT_PDI_ERROR_COUNTER_BF0_MASK)
/*! @} */

/*! @name PDI_ERROR_COUNTER_PDI - PDI Error counter */
/*! @{ */

