Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ECAT.h
/*! @name MII_MANAGEMENT_ECAT_ACCESS_STATE - MII Management ECAT Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT enables PDI takeover of MII management interface
 *  0b1..ECAT claims exclusive access to MII management interface
 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_MASK)

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_MASK (0xFEU)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI - MII Management ECAT Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT enables PDI takeover of MII management interface
 *  0b1..ECAT claims exclusive access to MII management interface
 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_MASK)

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_MASK (0xFEU)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_PDI_ACCESS_STATE - MII Management PDI Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT has access to MII management
 *  0b1..PDI has access to MII management
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_SHIFT (1U)
/*! BF1 - Force PDI Access State:
 *  0b0..Do not change Bit 0x0517[0]
 *  0b1..Reset Bit 0x0517[0] to 0
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_MASK (0xFCU)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_SHIFT (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_PDI_ACCESS_STATE_PDI - MII Management PDI Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT has access to MII management
 *  0b1..PDI has access to MII management
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_SHIFT (1U)
/*! BF1 - Force PDI Access State:
 *  0b0..Do not change Bit 0x0517[0]
 *  0b1..Reset Bit 0x0517[0] to 0
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_MASK (0xFCU)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_SHIFT (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_MASK)
/*! @} */

/*! @name PHY_PORT_STATUS - PHY Port */
/*! @{ */

#define ECAT_PHY_PORT_STATUS_BF0_MASK            (0x1U)
#define ECAT_PHY_PORT_STATUS_BF0_SHIFT           (0U)
/*! BF0 - Physical link status (PHY status register 1.2):
 *  0b0..No physical link
 *  0b1..Physical link detected
 */
#define ECAT_PHY_PORT_STATUS_BF0(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF0_SHIFT)) & ECAT_PHY_PORT_STATUS_BF0_MASK)

#define ECAT_PHY_PORT_STATUS_BF1_MASK            (0x2U)
#define ECAT_PHY_PORT_STATUS_BF1_SHIFT           (1U)
/*! BF1 - Link status (100 Mbit/s, Full Duplex, Auto negotiation):
 *  0b0..No link
 *  0b1..Link detected
 */
#define ECAT_PHY_PORT_STATUS_BF1(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF1_SHIFT)) & ECAT_PHY_PORT_STATUS_BF1_MASK)

#define ECAT_PHY_PORT_STATUS_BF2_MASK            (0x4U)
#define ECAT_PHY_PORT_STATUS_BF2_SHIFT           (2U)
/*! BF2 - Link status error:
 *  0b0..No error
 *  0b1..Link error, link inhibited
 */
#define ECAT_PHY_PORT_STATUS_BF2(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF2_SHIFT)) & ECAT_PHY_PORT_STATUS_BF2_MASK)

#define ECAT_PHY_PORT_STATUS_BF3_MASK            (0x8U)
#define ECAT_PHY_PORT_STATUS_BF3_SHIFT           (3U)
/*! BF3 - Read error:
 *  0b0..No read error occurred
 *  0b1..A read error has occurred
 */
#define ECAT_PHY_PORT_STATUS_BF3(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF3_SHIFT)) & ECAT_PHY_PORT_STATUS_BF3_MASK)

#define ECAT_PHY_PORT_STATUS_BF4_MASK            (0x10U)
#define ECAT_PHY_PORT_STATUS_BF4_SHIFT           (4U)
/*! BF4 - Link partner error:
 *  0b0..No error detected
 *  0b1..Link partner error
 */
#define ECAT_PHY_PORT_STATUS_BF4(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF4_SHIFT)) & ECAT_PHY_PORT_STATUS_BF4_MASK)

#define ECAT_PHY_PORT_STATUS_BF5_MASK            (0x20U)
#define ECAT_PHY_PORT_STATUS_BF5_SHIFT           (5U)
/*! BF5 - PHY configuration updated
 *  0b0..No update
 *  0b1..PHY configuration was updated
 */
#define ECAT_PHY_PORT_STATUS_BF5(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF5_SHIFT)) & ECAT_PHY_PORT_STATUS_BF5_MASK)

#define ECAT_PHY_PORT_STATUS_BF6_MASK            (0xC0U)
#define ECAT_PHY_PORT_STATUS_BF6_SHIFT           (6U)
/*! BF6 - Reserved */
#define ECAT_PHY_PORT_STATUS_BF6(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_BF6_SHIFT)) & ECAT_PHY_PORT_STATUS_BF6_MASK)
/*! @} */

/*! @name FMMU_LOGICAL_START_ADDRESS - Register Logical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_MASK (0xFFFFFFFFU)
#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - Logical start address within the EtherCAT Address Space. */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0(x)   (((uint32_t)(((uint32_t)(x)) << ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_ADDRESS */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_COUNT    (8U)

/*! @name FMMU_LOGICAL_START_ADDRESS_PDI - Register Logical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_MASK (0xFFFFFFFFU)
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - Logical start address within the EtherCAT Address Space. */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0(x) (((uint32_t)(((uint32_t)(x)) << ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_MASK)
/*! @} */

