Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ECAT.h
/* The count of ECAT_FMMU_LOGICAL_START_ADDRESS_PDI */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_COUNT (8U)

/*! @name FMMU_LENGTH - Register Length FMMU */
/*! @{ */

#define ECAT_FMMU_LENGTH_BF0_MASK                (0xFFFFU)
#define ECAT_FMMU_LENGTH_BF0_SHIFT               (0U)
/*! BF0 - Offset from the first logical FMMU byte to the last FMMU byte + 1 */
#define ECAT_FMMU_LENGTH_BF0(x)                  (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_LENGTH_BF0_SHIFT)) & ECAT_FMMU_LENGTH_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LENGTH */
#define ECAT_FMMU_LENGTH_COUNT                   (8U)

/*! @name FMMU_LENGTH_PDI - Register Length FMMU */
/*! @{ */

#define ECAT_FMMU_LENGTH_PDI_BF0_MASK            (0xFFFFU)
#define ECAT_FMMU_LENGTH_PDI_BF0_SHIFT           (0U)
/*! BF0 - Offset from the first logical FMMU byte to the last FMMU byte + 1 */
#define ECAT_FMMU_LENGTH_PDI_BF0(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_LENGTH_PDI_BF0_SHIFT)) & ECAT_FMMU_LENGTH_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LENGTH_PDI */
#define ECAT_FMMU_LENGTH_PDI_COUNT               (8U)

/*! @name FMMU_LOGICAL_START_BIT - Register Start bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_BIT_BF0_MASK     (0x7U)
#define ECAT_FMMU_LOGICAL_START_BIT_BF0_SHIFT    (0U)
/*! BF0 - Logical starting bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_START_BIT_BF0(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_BF0_MASK)

#define ECAT_FMMU_LOGICAL_START_BIT_BF3_MASK     (0xF8U)
#define ECAT_FMMU_LOGICAL_START_BIT_BF3_SHIFT    (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_START_BIT_BF3(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_BIT */
#define ECAT_FMMU_LOGICAL_START_BIT_COUNT        (8U)

/*! @name FMMU_LOGICAL_START_BIT_PDI - Register Start bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_MASK (0x7U)
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_SHIFT (0U)
/*! BF0 - Logical starting bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_MASK)

#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_MASK (0xF8U)
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_SHIFT (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_BIT_PDI */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_COUNT    (8U)

/*! @name FMMU_LOGICAL_STOP_BIT - Register Stop bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0_MASK      (0x7U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0_SHIFT     (0U)
/*! BF0 - Last logical bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_BF0_MASK)

#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3_MASK      (0xF8U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3_SHIFT     (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_STOP_BIT */
#define ECAT_FMMU_LOGICAL_STOP_BIT_COUNT         (8U)

/*! @name FMMU_LOGICAL_STOP_BIT_PDI - Register Stop bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_MASK  (0x7U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_SHIFT (0U)
/*! BF0 - Last logical bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_MASK)

#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_MASK  (0xF8U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_SHIFT (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_STOP_BIT_PDI */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_COUNT     (8U)

/*! @name FMMU_PHYSICAL_START_ADDRESS - Register Physical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_MASK (0xFFFFU)
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - Physical Start Address (mapped to logical Start address) */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0(x)  (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_ADDRESS */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_COUNT   (8U)

/*! @name FMMU_PHYSICAL_START_ADDRESS_PDI - Register Physical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_MASK (0xFFFFU)
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - Physical Start Address (mapped to logical Start address) */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_COUNT (8U)

/*! @name FMMU_PHYSICAL_START_BIT - Register Physical Start bit FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_BIT_BF0_MASK    (0x7U)
#define ECAT_FMMU_PHYSICAL_START_BIT_BF0_SHIFT   (0U)
/*! BF0 - Physical starting bit as target of logical start bit mapping (bits are counted from least
 *    significant bit 0 to most significant bit 7)
 */
#define ECAT_FMMU_PHYSICAL_START_BIT_BF0(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_PHYSICAL_START_BIT_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_BIT_BF0_MASK)

