Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ECAT.h
/*! @name SPEED_COUNTER_START - Register Speed Counter Start */
/*! @{ */

#define ECAT_SPEED_COUNTER_START_BF0_MASK        (0x7FFFU)
#define ECAT_SPEED_COUNTER_START_BF0_SHIFT       (0U)
/*! BF0 - Bandwidth for adjustment of local copy of system Time (larger values -> smaller bandwidth and smoother adjustment) */
#define ECAT_SPEED_COUNTER_START_BF0(x)          (((uint16_t)(((uint16_t)(x)) << ECAT_SPEED_COUNTER_START_BF0_SHIFT)) & ECAT_SPEED_COUNTER_START_BF0_MASK)

#define ECAT_SPEED_COUNTER_START_BF15_MASK       (0x8000U)
#define ECAT_SPEED_COUNTER_START_BF15_SHIFT      (15U)
/*! BF15 - Reserved, write 0 */
#define ECAT_SPEED_COUNTER_START_BF15(x)         (((uint16_t)(((uint16_t)(x)) << ECAT_SPEED_COUNTER_START_BF15_SHIFT)) & ECAT_SPEED_COUNTER_START_BF15_MASK)
/*! @} */

/*! @name SPEED_COUNTER_DIFF - Register Speed Counter Diff */
/*! @{ */

#define ECAT_SPEED_COUNTER_DIFF_BF0_MASK         (0xFFFFU)
#define ECAT_SPEED_COUNTER_DIFF_BF0_SHIFT        (0U)
/*! BF0 - Representation of the deviation between local clock period and Reference Clock's clock
 *    period (representation: two's complement)
 */
#define ECAT_SPEED_COUNTER_DIFF_BF0(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_SPEED_COUNTER_DIFF_BF0_SHIFT)) & ECAT_SPEED_COUNTER_DIFF_BF0_MASK)
/*! @} */

/*! @name SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH - Register System Time Difference Filter Depth */
/*! @{ */

#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF0_MASK (0xFU)
#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF0_SHIFT (0U)
/*! BF0 - Filter depth for averaging the received System Time deviation */
#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF0_SHIFT)) & ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF0_MASK)

#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF4_MASK (0xF0U)
#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF4_SHIFT (4U)
/*! BF4 - Reserved, write 0 */
#define ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF4_SHIFT)) & ECAT_SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH_BF4_MASK)
/*! @} */

/*! @name SPEED_COUNTER_FILTER_DEPTH - Register Speed Counter Filter Depth */
/*! @{ */

#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF0_MASK (0xFU)
#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF0_SHIFT (0U)
/*! BF0 - Filter depth for averaging the clock period deviation */
#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF0(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_SPEED_COUNTER_FILTER_DEPTH_BF0_SHIFT)) & ECAT_SPEED_COUNTER_FILTER_DEPTH_BF0_MASK)

#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF4_MASK (0xF0U)
#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF4_SHIFT (4U)
/*! BF4 - Reserved, write 0 */
#define ECAT_SPEED_COUNTER_FILTER_DEPTH_BF4(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_SPEED_COUNTER_FILTER_DEPTH_BF4_SHIFT)) & ECAT_SPEED_COUNTER_FILTER_DEPTH_BF4_MASK)
/*! @} */

/*! @name CYCLIC_UNIT_CONTROL - Register Cyclic Unit Control */
/*! @{ */

#define ECAT_CYCLIC_UNIT_CONTROL_BF0_MASK        (0x1U)
#define ECAT_CYCLIC_UNIT_CONTROL_BF0_SHIFT       (0U)
/*! BF0 - SYNC out unit control:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_BF0(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_BF0_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_BF0_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_BF1_MASK        (0xEU)
#define ECAT_CYCLIC_UNIT_CONTROL_BF1_SHIFT       (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_CYCLIC_UNIT_CONTROL_BF1(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_BF1_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_BF1_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_BF4_MASK        (0x10U)
#define ECAT_CYCLIC_UNIT_CONTROL_BF4_SHIFT       (4U)
/*! BF4 - Latch In unit 0:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_BF4(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_BF4_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_BF4_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_BF5_MASK        (0x20U)
#define ECAT_CYCLIC_UNIT_CONTROL_BF5_SHIFT       (5U)
/*! BF5 - Latch In unit 1:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_BF5(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_BF5_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_BF5_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_BF6_MASK        (0xC0U)
#define ECAT_CYCLIC_UNIT_CONTROL_BF6_SHIFT       (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_CYCLIC_UNIT_CONTROL_BF6(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_BF6_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_BF6_MASK)
/*! @} */

/*! @name CYCLIC_UNIT_CONTROL_PDI - Register Cyclic Unit Control */
/*! @{ */

#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF0_MASK    (0x1U)
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF0_SHIFT   (0U)
/*! BF0 - SYNC out unit control:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF0(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_PDI_BF0_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_PDI_BF0_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF1_MASK    (0xEU)
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF1_SHIFT   (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF1(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_PDI_BF1_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_PDI_BF1_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF4_MASK    (0x10U)
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF4_SHIFT   (4U)
/*! BF4 - Latch In unit 0:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF4(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_PDI_BF4_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_PDI_BF4_MASK)

#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF5_MASK    (0x20U)
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF5_SHIFT   (5U)
/*! BF5 - Latch In unit 1:
 *  0b0..ECAT-controlled
 *  0b1..PDI-controlled
 */
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF5(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_PDI_BF5_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_PDI_BF5_MASK)

